benchmarks/vllm/tm-l40s/Qwen3.6-27B/tm-l40sx2_qwen27b_in128_out128_p100_c1_90a941.txt
BENCHMARK: tm-l40sx2_qwen27b_in128_out128_p100_c1_90a941
================================================================
Namespace(subparser='bench', bench_type='serve', dispatch_function=<function BenchmarkServingSubcommand.cmd at 0x74b7037acea0>, trust_remote_code=False, seed=0, num_prompts=100, dataset_name='random', no_stream=False, dataset_path=None, no_oversample=False, skip_chat_template=False, enable_multimodal_chat=False, disable_shuffle=False, custom_output_len=256, spec_bench_output_len=256, spec_bench_category=None, sonnet_input_len=550, sonnet_output_len=150, sonnet_prefix_len=200, sharegpt_output_len=None, blazedit_min_distance=0.0, blazedit_max_distance=1.0, asr_max_audio_len_sec=inf, asr_min_audio_len_sec=0.0, random_input_len=128, random_output_len=128, random_range_ratio=0.0, random_prefix_len=0, random_batch_size=1, no_reranker=False, random_mm_base_items_per_request=1, random_mm_num_mm_items_range_ratio=0.0, random_mm_limit_mm_per_prompt={'image': 255, 'video': 1}, random_mm_bucket_config={(256, 256, 1): 0.5, (720, 1280, 1): 0.5, (720, 1280, 16): 0.0}, hf_subset=None, hf_split=None, hf_name=None, hf_output_len=None, prefix_repetition_prefix_len=256, prefix_repetition_suffix_len=256, prefix_repetition_num_prefixes=10, prefix_repetition_output_len=128, label=None, backend='vllm', base_url='http://localhost:8000', host='127.0.0.1', port=8000, endpoint='/v1/completions', header=None, max_concurrency=1, model='Qwen/Qwen3.6-27B', input_len=None, output_len=None, tokenizer=None, tokenizer_mode='auto', use_beam_search=False, logprobs=None, request_rate=inf, burstiness=1.0, disable_tqdm=False, num_warmups=0, profile=False, save_result=True, save_detailed=True, append_result=False, metadata=None, result_dir='./benchmarks/vllm/tm-l40s/Qwen3.6-27B', result_filename='tm-l40sx2_qwen27b_in128_out128_p100_c1_90a941.json', ignore_eos=True, percentile_metrics='ttft,tpot,itl,e2el', metric_percentiles='99', goodput=None, request_id_prefix='bench-fe8abb8f-', top_p=None, top_k=None, min_p=None, temperature=None, frequency_penalty=None, presence_penalty=None, repetition_penalty=None, served_model_name=None, lora_modules=None, lora_assignment='random', ramp_up_strategy=None, ramp_up_start_rps=None, ramp_up_end_rps=None, ready_check_timeout_sec=0, extra_body=None, skip_tokenizer_init=False, insecure=False, plot_timeline=False, timeline_itl_thresholds=[25.0, 50.0], plot_dataset_stats=False)
INFO 04-28 07:54:52 [datasets.py:700] Sampling input_len from [128, 128] and output_len from [128, 128]
WARNING: vllm bench serve no longer sets temperature==0 (greedy) in requests by default. The default will be determined on the server side and can be model/API specific. For the old behavior, include --temperature=0.
Starting initial single prompt test run...
Skipping endpoint ready check.
Starting main benchmark run...
Traffic request rate: inf
Burstiness factor: 1.0 (Poisson process)
Maximum request concurrency: 1

  0%|          | 0/100 [00:00<?, ?it/s]
  1%|          | 1/100 [00:05<08:15,  5.00s/it]
  2%|▏         | 2/100 [00:09<08:09,  4.99s/it]
  3%|▎         | 3/100 [00:14<08:03,  4.99s/it]
  4%|▍         | 4/100 [00:19<07:58,  4.99s/it]
  5%|▌         | 5/100 [00:24<07:53,  4.99s/it]
  6%|▌         | 6/100 [00:29<07:48,  4.98s/it]
  7%|▋         | 7/100 [00:34<07:43,  4.98s/it]
  8%|▊         | 8/100 [00:39<07:38,  4.98s/it]
  9%|▉         | 9/100 [00:44<07:33,  4.98s/it]
 10%|█         | 10/100 [00:49<07:28,  4.98s/it]
 11%|█         | 11/100 [00:54<07:23,  4.98s/it]
 12%|█▏        | 12/100 [00:59<07:18,  4.98s/it]
 13%|█▎        | 13/100 [01:04<07:13,  4.99s/it]
 14%|█▍        | 14/100 [01:09<07:08,  4.99s/it]
 15%|█▌        | 15/100 [01:14<07:03,  4.99s/it]
 16%|█▌        | 16/100 [01:19<06:58,  4.99s/it]
 17%|█▋        | 17/100 [01:24<06:53,  4.98s/it]
 18%|█▊        | 18/100 [01:29<06:48,  4.98s/it]
 19%|█▉        | 19/100 [01:34<06:43,  4.98s/it]
 20%|██        | 20/100 [01:39<06:38,  4.98s/it]
 21%|██        | 21/100 [01:44<06:33,  4.98s/it]
 22%|██▏       | 22/100 [01:49<06:28,  4.98s/it]
 23%|██▎       | 23/100 [01:54<06:23,  4.98s/it]
 24%|██▍       | 24/100 [01:59<06:18,  4.98s/it]
 25%|██▌       | 25/100 [02:04<06:13,  4.98s/it]
 26%|██▌       | 26/100 [02:09<06:08,  4.98s/it]
 27%|██▋       | 27/100 [02:14<06:03,  4.98s/it]
 28%|██▊       | 28/100 [02:19<05:58,  4.98s/it]
 29%|██▉       | 29/100 [02:24<05:53,  4.98s/it]
 30%|███       | 30/100 [02:29<05:48,  4.98s/it]
 31%|███       | 31/100 [02:34<05:43,  4.98s/it]
 32%|███▏      | 32/100 [02:39<05:38,  4.98s/it]
 33%|███▎      | 33/100 [02:44<05:33,  4.98s/it]
 34%|███▍      | 34/100 [02:49<05:28,  4.98s/it]
 35%|███▌      | 35/100 [02:54<05:23,  4.98s/it]
 36%|███▌      | 36/100 [02:59<05:19,  4.98s/it]
 37%|███▋      | 37/100 [03:04<05:14,  4.98s/it]
 38%|███▊      | 38/100 [03:09<05:09,  4.98s/it]
 39%|███▉      | 39/100 [03:14<05:04,  4.98s/it]
 40%|████      | 40/100 [03:19<04:59,  4.98s/it]
 41%|████      | 41/100 [03:24<04:54,  4.98s/it]
 42%|████▏     | 42/100 [03:29<04:49,  4.98s/it]
 43%|████▎     | 43/100 [03:34<04:44,  4.98s/it]
 44%|████▍     | 44/100 [03:39<04:39,  4.98s/it]
 45%|████▌     | 45/100 [03:44<04:34,  4.98s/it]
 46%|████▌     | 46/100 [03:49<04:29,  4.98s/it]
 47%|████▋     | 47/100 [03:54<04:24,  4.98s/it]
 48%|████▊     | 48/100 [03:59<04:19,  4.98s/it]
 49%|████▉     | 49/100 [04:04<04:14,  4.98s/it]
 50%|█████     | 50/100 [04:09<04:09,  4.98s/it]
 51%|█████     | 51/100 [04:14<04:04,  4.98s/it]
 52%|█████▏    | 52/100 [04:19<03:59,  4.98s/it]
 53%|█████▎    | 53/100 [04:24<03:54,  4.98s/it]
 54%|█████▍    | 54/100 [04:29<03:49,  4.98s/it]
 55%|█████▌    | 55/100 [04:34<03:44,  4.98s/it]
 56%|█████▌    | 56/100 [04:39<03:39,  4.98s/it]
 57%|█████▋    | 57/100 [04:44<03:34,  4.98s/it]
 58%|█████▊    | 58/100 [04:49<03:29,  4.98s/it]
 59%|█████▉    | 59/100 [04:54<03:24,  4.98s/it]
 60%|██████    | 60/100 [04:59<03:19,  4.98s/it]
 61%|██████    | 61/100 [05:04<03:14,  4.98s/it]
 62%|██████▏   | 62/100 [05:09<03:09,  4.98s/it]
 63%|██████▎   | 63/100 [05:14<03:04,  4.98s/it]
 64%|██████▍   | 64/100 [05:19<02:59,  4.98s/it]
 65%|██████▌   | 65/100 [05:23<02:54,  4.98s/it]
 66%|██████▌   | 66/100 [05:28<02:49,  4.98s/it]
 67%|██████▋   | 67/100 [05:33<02:44,  4.98s/it]
 68%|██████▊   | 68/100 [05:38<02:39,  4.98s/it]
 69%|██████▉   | 69/100 [05:43<02:34,  4.98s/it]
 70%|███████   | 70/100 [05:48<02:29,  4.98s/it]
 71%|███████   | 71/100 [05:53<02:24,  4.98s/it]
 72%|███████▏  | 72/100 [05:58<02:19,  4.98s/it]
 73%|███████▎  | 73/100 [06:03<02:14,  4.98s/it]
 74%|███████▍  | 74/100 [06:08<02:09,  4.98s/it]
 75%|███████▌  | 75/100 [06:13<02:04,  4.98s/it]
 76%|███████▌  | 76/100 [06:18<01:59,  4.98s/it]
 77%|███████▋  | 77/100 [06:23<01:54,  4.98s/it]
 78%|███████▊  | 78/100 [06:28<01:49,  4.98s/it]
 79%|███████▉  | 79/100 [06:33<01:44,  4.98s/it]
 80%|████████  | 80/100 [06:38<01:39,  4.98s/it]
 81%|████████  | 81/100 [06:43<01:34,  4.98s/it]
 82%|████████▏ | 82/100 [06:48<01:29,  4.98s/it]
 83%|████████▎ | 83/100 [06:53<01:24,  4.98s/it]
 84%|████████▍ | 84/100 [06:58<01:19,  4.99s/it]
 85%|████████▌ | 85/100 [07:03<01:14,  4.98s/it]
 86%|████████▌ | 86/100 [07:08<01:09,  4.98s/it]
 87%|████████▋ | 87/100 [07:13<01:04,  4.98s/it]
 88%|████████▊ | 88/100 [07:18<00:59,  4.98s/it]
 89%|████████▉ | 89/100 [07:23<00:54,  4.98s/it]
 90%|█████████ | 90/100 [07:28<00:49,  4.98s/it]
 91%|█████████ | 91/100 [07:33<00:44,  4.98s/it]
 92%|█████████▏| 92/100 [07:38<00:39,  4.98s/it]
 93%|█████████▎| 93/100 [07:43<00:34,  4.98s/it]
 94%|█████████▍| 94/100 [07:48<00:29,  4.98s/it]
 95%|█████████▌| 95/100 [07:53<00:24,  4.98s/it]
 96%|█████████▌| 96/100 [07:58<00:19,  4.98s/it]
 97%|█████████▋| 97/100 [08:03<00:14,  4.98s/it]
 98%|█████████▊| 98/100 [08:08<00:09,  4.98s/it]
 99%|█████████▉| 99/100 [08:13<00:04,  4.99s/it]
100%|██████████| 100/100 [08:18<00:00,  4.98s/it]
100%|██████████| 100/100 [08:18<00:00,  4.98s/it]
tip: install termplotlib and gnuplot to plot the metrics
============ Serving Benchmark Result ============
Successful requests:                     100       
Failed requests:                         0         
Maximum request concurrency:             1         
Benchmark duration (s):                  498.43    
Total input tokens:                      12800     
Total generated tokens:                  12800     
Request throughput (req/s):              0.20      
Output token throughput (tok/s):         25.68     
Peak output token throughput (tok/s):    26.00     
Peak concurrent requests:                2.00      
Total token throughput (tok/s):          51.36     
---------------Time to First Token----------------
Mean TTFT (ms):                          76.80     
Median TTFT (ms):                        76.55     
P99 TTFT (ms):                           77.49     
-----Time per Output Token (excl. 1st token)------
Mean TPOT (ms):                          38.64     
Median TPOT (ms):                        38.64     
P99 TPOT (ms):                           38.66     
---------------Inter-token Latency----------------
Mean ITL (ms):                           38.64     
Median ITL (ms):                         38.64     
P99 ITL (ms):                            38.96     
----------------End-to-end Latency----------------
Mean E2EL (ms):                          4984.14   
Median E2EL (ms):                        4984.25   
P99 E2EL (ms):                           4986.83   
==================================================